module InstMemory (
    input  [31:0] A,
    output [31:0] RD
); 

    // تعریف حافظه: آرایه‌ای از کلمات 32 بیتی (چون کدهای ماشین در فایل تکست 32 بیتی هستند)
    // 16384 خانه 32 بیتی
    reg [31:0] instMem [0:16383];

    // متصل کردن آدرس:
    // از آنجا که آدرس (PC) چهار تا چهار تا جلو می‌رود اما خانه‌های این آرایه یکی یکی،
    // باید آدرس را بر 4 تقسیم کنیم که معادل حذف 2 بیت کم‌ارزش (A[31:2]) است.
    wire [29:0] adr;
    assign adr = A[31:2]; 

    // بارگذاری فایل کدهای ماشین (همان کدهایی که کپی کردید را در این فایل قرار دهید)
    initial begin
        $readmemh("inst.mem", instMem);
    end

    // قرار دادن دستورالعمل خوانده شده در خروجی
    assign RD = instMem[adr];

endmodule
